# GetShellComponent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedSolidOrShell..::..GetShellComponent Method
TriangulatedSolidOrShell Class See Also
---
Returns the specified shell component of a solid or shell. Input componentIndex must lie between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent should not be modified by the caller.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TriangulatedShellComponent GetShellComponent(
	int componentIndex
)
```

Visual Basic
---
```text
Public Function GetShellComponent ( _
	componentIndex As Integer _
) As TriangulatedShellComponent
```

Visual C++
---
```text
public:
TriangulatedShellComponent^ GetShellComponent(
	int componentIndex
)
```

# ### Parameters
componentIndex
    Type: System..::..Int32 The component index, must be between 0 and ShellComponentCount – 1, inclusive.
# ### Return Value
The component.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Shell component index componentIndex is out of range. |

# See Also
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace